from twythonxx import twit #ใช้เรียกcalss  จากไฟล twythonxx

e=twit() #ทำการประกาศตัวแปร eเป็นobjของ class twit 
#-----------------------------------------------
#e.post("testtest")
#ใช้สำหรับโพสโดยแก้ค่าในวงเล็บให้เป็นข้อความตามที่ต้องการโพส โดยมีลิมิตอยู่ที่300ครั้ง/3ชม
#-----------------------------------------------
#data=e.search("#lisa")
#ใช้สำหรับค้นหาโดยแก้ค่าในวงเล็บให้เป็นข้อความที่ต้องหารค้นหา โดยมีลิมิตอยู่ที่180 ครั้ง/15นาที
#ค่าที่ได้จะออกมาในรูปของlistของแต่ล่ะทวิตซึ่งแต่ล่ะทวิตจะเป็น dict ที่ประกอบด้วยสมาชิกดังนี้ 'screen_name','id_user','tweet_when','tweet_id','text'
#-----------------------------------------------
#ใช้สำหรับค้นหาแบบที่ต้องการกำหนดรายละเอียดการค้นหาโดยจะให้ผลเป็น listที่ประกอบขึ้นจากdictโดยแต่ล่ะdictแทนทวิตแต่ล่ะข้อความที่ค้นเจอ
#x={'count' : 5}#ตัวแปรสำหรับระบุรายละเอียดการค้นหาประกอบด้วย 'result_type' 'lang' 'count' 'until'
#data=e.search2("#lisa",'screen_name','tweet_id',**x) #สามารถระบุประเภทข้อมูลที่ต้องการได้โดยใช้ all หากต้องการทุกค่า ข้อมูลที่สามารถระบุได้มีดังนี้ 'screen_name','id_user','tweet_when','tweet_id','text'
#-----------------------------------------------
#e.stream('#lisa')#คำสั่งนี้จะใช้สำหรับติดตามแทกที่ต้องการโดยจะแสดงผลทวิตใหม่ทุกรั้งทีมีการทวิตแทกนี้
#-----------------------------------------------
#print(data) #ทำการแสดงผลตัวแปร dataที่ได้


